Revit 2026 API

# StructuralSectionGeneralHOuterFillet Property

---

Outer Fillet - Corner fillet outer radius.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double OuterFillet { get; set; }
```
```vb
Public Property OuterFillet As Double
	Get
	Set
```
```cpp
public:
property double OuterFillet {
	double get ();
	void set (double value);
}
```
```fsharp
member OuterFillet : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralH Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace